Tarefa - Módulo 4

In [2]:
import sqlite3

In [3]:
conexao = sqlite3.connect("banco_de_dados.db")
print(conexao)

<sqlite3.Connection object at 0x00000158858458A0>

In [4]:
cursor = conexao.cursor()

Exercício 1

In [4]:
cursor.execute ("CREATE TABLE dados_cadastrais (id integer, nome text, sobrenome text, data_nascimento text, cpf integer, endereco text)")

In [5]:
cursor.execute("INSERT INTO dados_cadastrais VALUES (1, 'Maria', 'Silva', '', 11111211313, 'Rua 1 - SP')")
cursor.execute("INSERT INTO dados_cadastrais VALUES (2, 'João', 'Silva', '', 11111211889,  'Rua 2 - SP')")
cursor.execute("INSERT INTO dados_cadastrais VALUES (3, 'Pedro', 'Pereira', '', 11111211786, 'Rua 8 - SP')")
cursor.execute("INSERT INTO dados_cadastrais VALUES (4, 'Paulo', 'Ribeiro', '', 11111211123, 'Rua 9 - SP')")
conexao.commit()

In [6]:
cursor.execute("SELECT * FROM dados_cadastrais")
cursor.fetchall()

[(1, 'Maria', 'Silva', '', 11111211313, 'Rua 1 - SP'),
 (2, 'João', 'Silva', '', 11111211889, 'Rua 2 - SP'),
 (3, 'Pedro', 'Pereira', '', 11111211786, 'Rua 8 - SP'),
 (4, 'Paulo', 'Ribeiro', '', 11111211123, 'Rua 9 - SP')]

In [7]:
cursor.execute("CREATE TABLE dados_profissionais (id text, graduação text, cargo text, salario integer, tempo_casa integer)")

In [8]:
cursor.execute("INSERT INTO dados_profissionais VALUES (1, 'matemática', 'professor', 3500.89, 3)")
cursor.execute("INSERT INTO dados_profissionais VALUES (2, 'geografia', 'orientador', 2850.80, 1)")
cursor.execute("INSERT INTO dados_profissionais VALUES (3, 'história', 'orientador', 3200.45, 1)")
cursor.execute("INSERT INTO dados_profissionais VALUES (4, 'física', 'professor', 1890.33, 2)")
conexao.commit()

In [9]:
cursor.execute("SELECT * FROM dados_profissionais")
cursor.fetchall()

[('1', 'matemática', 'professor', 3500.89, 3),
 ('2', 'geografia', 'orientador', 2850.8, 1),
 ('3', 'história', 'orientador', 3200.45, 1),
 ('4', 'física', 'professor', 1890.33, 2)]

Exercício 2

In [10]:
cursor.execute ("SELECT * FROM dados_profissionais ORDER BY tempo_casa DESC ")
cursor.fetchall()

[('1', 'matemática', 'professor', 3500.89, 3),
 ('4', 'física', 'professor', 1890.33, 2),
 ('2', 'geografia', 'orientador', 2850.8, 1),
 ('3', 'história', 'orientador', 3200.45, 1)]

Exercício 3

In [12]:
cursor.execute("SELECT COUNT (id)  FROM dados_profissionais")
cursor.fetchall()

[(4,)]

Exercício 4

In [5]:
cursor.execute("SELECT nome, sobrenome FROM dados_cadastrais WHERE sobrenome == 'Silva' ORDER BY nome ASC")
cursor.fetchall()

[('João', 'Silva'), ('Maria', 'Silva')]

Exercício 5

In [14]:
cursor.execute("SELECT SUM (salario), cargo FROM dados_profissionais GROUP BY cargo")
cursor.fetchall()

[(6051.25, 'orientador'), (5391.219999999999, 'professor')]